{
    "zh":"中文 (zh-TW)",
    "en":"English (en-US)",
    "selfInfoTitle":"Self Info",
    "educationTitle":"Education",
    "schoolDesc":"KAO YUAN UNIVERSITY （Graduated）\nDepartment of Marketing and Distribution Management",
    "hobbyTitle":"Hobby",
    "skillTitle":"Professional Skill",
    "experienceTitle":"Experience",
    "collectionTitle":"Collection",
    "selfDesc":"In the past, I have been exploring suitable jobs, most of which are related to the nature of the service industry. Later, when I came into contact with the frontend of the web page, I seemed to see a different world. What I have learned so far may be a long way from the industry, but I still continue to learn various new technologies. I hope that I can continue to study in the frontend field and learn newer technologies in the workplace, and develope the better website. hope in the future can develop to full-stack, or develop artificial intelligence.",
    "localBlock":"Kaohsiung City - Taiwan",
    "hobbyDesc":"When relaxing, I like to go to the beach to watch the scenery and the bright moon at night and the whole starry sky, I like photography, study various content in the field of science and technology, psychology content, and occasionally I like to mix drinks by myself, and learn some things that I have never come into contact and get in touch with nature.",
    "collectDescTitle":"Works Description",
    "collectUseSkillTitle": "Use Language",
    "collectUseKitsAndFramesTitle":"Kits and Frames",
    "collectTitleGroup":{
        "calculator":"Calculator",
        "multipurposeCanvas":"Multipurpose Canvas",
        "globalClock":"Global Clock",
        "imageController":"Image Controller",
        "memoryCardGame":"MemoryCard Game",
        "personalityTest":"Personality Test",
        "keyBoardSound":"KeyBoard Sound",
        "mediaPlayer":"Media Player",
        "puzzleGame":"Puzzle Game",
        "toDoList":"Todo List",
        "travelSite":"Travel Site",
        "weather":"Weather",
        "BMICalculator":"BMI Calculator",
        "fashionShop":"Fashion Shop",
        "blog":"Blog",
        "astrologySite":"Astrology Site",
        "mediaSite":"Media Site",
        "store":"Store",
        "hotels":"Hotels",
        "movies":"Movies",
        "radio":"Radio",
        "countDown":"New Year Count Down",
        "invoiceCheck":"Invoice Check",
        "colorConverter":"Color Converter",
        "DevelopmentLibrary":"Development Library"
    },
    "collectDescGroup":{
        "calculator":"It is an original work,and there are some animations added by myself.This works is purely for practice portfolios,without any commercial use.",
        "multipurposeCanvas":"Canvas, and some animations added by myself.Some of the original content have been greatly changed.It is a js 30-day practice topic.I have made some changes in the content.This works is purely for practice portfolios,without any commercial use.",
        "globalClock":"The clock, and some animations added by myself,are practice questions for js 30 days,I have made some changes in the content,changed it to the world clock,connected Word Time Api, and used the personal develop library to write,interface animation and new additions The content is original,this works is purely for practice portfolio,without any commercial use",
        "imageController":"For js 30 days practice questions,there are also some animations added by myself.Some of the original content has been greatly changed,and some changes have been made in the content.This works is purely for practice, without using any framework,without any business use",
        "memoryCardGame":"A simple flop game,and some animations added by myself, and use Vercel PostgreSQL + Express backend service to save rank history.This works is purely for practice,without any framework or commercial use.",
        "personalityTest":"Personality test,and some animations added by myself.All animations,layout design and functions are original.The content of the test and the final analysis results are extracted from the Internet.This works is purely for practice portfolios and has no commercial use.",
        "keyBoardSound":"Keyboard music, as well as some animations added by myself,press the corresponding keys on the keyboard,there will be sound and interactive effects,the volume can be adjusted on the right side,it is a js 30 days practice topic,I have made some changes in the content,this works is purely a practice use,without using any framework,without any commercial use.",
        "mediaPlayer":"The media player,and some animations added by myself,some greatly changed the original content,it's js 30 days practice questions,some made a lot of changes in content,this works is purely for practice portfolios,no use of any frame,without any commercial use.",
        "puzzleGame":"Jigsaw puzzle game,and some animations added by myself.This is an example of a jigsaw puzzle game on the Internet,and the original content has been greatly changed.It is completely different from the original.This works is purely for practice without any commercial use.",
        "toDoList":"To-do list,and some animations added by myself.Some of the original content has been greatly changed.It is completely different from the original.It is a js 30-day practice topic.This works is purely for practice.No framework is used,no any commercial use",
        "travelSite":"Travel Site,and some animations added by myself.This works is purely for practice.Bootstrap framework is used,and there is no commercial use.",
        "weather":"Weather query,fetch to the Central Meteorological Administration Api,the Api data content is updated every 6 hours,and there are some animations added by yourself,all content is original,this works is purely for practice,without any commercial use.",
        "BMICalculator":"BMI calculator,and some animations added by myself,this works is purely for practice,using the bootstrap framework,without any commercial use.",
        "fashionShop":"The simulate e-commerce website developed based on Vite and use virtual database Sql Server established with Vercel Postgress,it's with simple e-commerce functions,All content is original content,used for the portfolio,without any commercial use.",
        "blog":"A personal blog with layout design inspired by Pinterest, featuring original animations. It's using Vercel PostgreSQL and an Express backend to enable modification, addition, and deletion of articles, along with a comment function. SPA navigation is utilized to switch between different pages, reducing the time spent on screen refresh.",
        "astrologySite":"Astrology site,you can check the constellation's own information and the compatibility of other constellations etc.The content is the data collected on the Internet,and the data is integrated and presented Use JSON. It's a PWA Application. This works is purely for practice,without any commercial use.",
        "mediaSite":"Media website,fetch to youtube Data 3 Api for information integration,it can stream and play youtube videos Use video.js,and also can such as search videos and video playlists.The animation and animation are all original productions.This work is purely for practice and does not have any commercial use.",
        "store":"Fetching the itues Api for information integration,it can play itunes movie trailers、music audition、etc,but because the same source has locked some URL content,some content may not be able to be opened,you may need to use Cross Any Where proxy server,which can be accessed Use OpenCross Link,and click 'Request temporary access to the demo server' to temporarily unlock cross-domain,but only some cross-domain content can be opened.All layouts and animations are original productions.This works is purely an practice,without any commercial use.",
        "hotels":"Fetching to the government's Open Api Hotel information database for information integration.It's haveing embed a google map Use an iframe,you can see the detailed location of the hotel.When you enter the page,you can open the positioning to see the hotels near the location,and you can view hotel information and collection etc,but because the same source has locked some URL content,it will not be able to get the data directly,you may need to use the Cross Any Where proxy server,you can connect Use OpenCross,and click 'Request temporary access to the demo server' to temporarily The cross-domain unlock of,all the layout design and animation are original production,this works is purely for practice,without any commercial use.",
        "movies":"Fetching to all the star ratings、reviews、actors、movies,and albums of TMDB Api.The UI part has reference online layout production,and the content is all written in React Hook and function Component.This work is purely for practice use,without any commercial use.",
        "radio":"Write a Restful api Use Express,fetching the hinet online radio and SQLite3 database.This desktop application made by Electron,which can run on Windows and MacOS,and can be added to collect.The collect data is written into SQLite,and the screen design is original The content,the content is all written by React Hook and function Component,this work is purely for practice,without any commercial use.",
        "countDown":"New Year count down, with fireworks released at the end of the year for five minutes, including multiple languages. This project is purely for portfolio practice purposes and has no commercial use.",
        "invoiceCheck":"Uniform Invoice Number Display, Simply retrieves and displays uniform invoice numbers. This project is solely for portfolio practice purposes and has no commercial use.",
        "colorConverter":"Multi-color Converter: Includes various color conversions, as well as commonly used color palettes and even color checking functions. This project is solely for portfolio practice purposes and has no commercial use.",
        "DevelopmentLibrary":"This is a commonly used function library developed by individuals,similar to jQurey.There are three versions of Javascript、TypeScript、CoffeeScript.The content is continuously updated.The current version is 1.6.8"
    },
    "skillDescGroup": {
        "coreLang":"Core Language",
        "UILibrary": "UI Library",
        "buildTool": "Build Tool",
        "frontend":"Frontend",
        "backend":"Backend",
        "database":"Database",
        "encryptionTechnology": "Encryption Technology",
        "microService":"Micro Service",
        "devTool": "Develop Tool (IDE)",
        "versionControll":"Version Controll"
    },
    "workExperienceGroup": {
        "wRoleOnly":"PG",
        "wRoleOnlyWithCli":"PG（Cli Package Chitecture Design）",
        "wRoleFrontend":"PG（frontend）",
        "wRoleBackend":"PG（backend）",
        "wRoleFullStack":"PG（fullstack）",
        "w1Title":"Chunghwa Telecom - Industrial Internet",
        "w1Desc":"My main responsibility is to develop frontend UI and business logic by utilizing React Hooks, React-Redux, and Redux Saga. Additionally, I integrate with backend APIs Use Express to establish RESTful APIs. This facilitates the retrieval of GET or POST data formats for mock data integration, speeding up development. I also optimize existing code structures.",
        "w2Title":"Institute for Information Industry - Linkou Data Platform （frontend platform,backend platform）",
        "w2Desc":"My main responsibility is using React to develop frontend UI screens and integrate business logic with backend APIs. I establish a server and RESTful APIs using Express, Use which I retrieve GET or POST data formats from the backend for mock data integration to expedite development.",
        "w3Title":"Institute for Information Industry - Linkou Data Contest （frontend platform,backend platform）",
        "w3Desc":"My main responsibility is using React to develop frontend UI screens and integrate business logic with backend APIs. I establish a server and RESTful APIs using Express, Use which I retrieve GET or POST data formats from the backend for mock data integration to expedite development.",
        "w4Title":"Institute for Information Industry - Linkou Data Situation Room",
        "w4Desc":"My main responsibility is using React to develop frontend UI screens and integrate business logic with backend APIs. I establish a server and RESTful APIs using Express, Use which I retrieve GET or POST data formats from the backend for mock data integration to expedite development.",
        "w5Title":"Institute for Information Industry - Taoyuan Airport Current Situation Survey",
        "w5Desc":"Maintenance and development involve maintaining and developing existing software, along with an annual status survey in July. The survey primarily involves airports filling out current status information, such as system details, procedural adjustments, questionnaire items, and login mechanism modifications. The frontend UI screens and business logic are developed using React, and they interface with the backend .NET C# MVC （utilizing only Controllers and Models）.",
        "w6Title":"Institute for Information Industry - Machinery Cloud Market",
        "w6Desc":"Maintain and develop existing programs, mainly writing schedules for calculating monthly billing and profit sharing data, and publishing APIs for APP subscription or cancellation, buyout. Use Express to create a backend and handle related accounting and new APP business logic.",
        "w7Title":"Institute for Information Industry - Machinery Cloud Market Payment Gateway Backend",
        "w7Desc":"Maintain and develop existing programs, obtain billing data from the cloud market backend, and write cash flow services such as order payment, order inquiry, and refund. Use .Net MVC to write Payment Gateway-related transaction business logic to interact with the RSA encryption function and payment screen, and use WebSocket to return real-time transaction status Use the Callback api provided by the Payment Gateway vendor.",
        "w8Title":"Institute for Information Industry - Livecome Electronic Supervision System",
        "w8Desc":"The new development program primarily involves interfacing frontend UI with backend APIs and WebSocket data to present AI-driven models' results for skincare products or courses and interact with the interface. It is mainly done using React, responsible for designing frontend UI/UX screens and integrating business logic with backend APIs. Additionally, before the API is fully developed, an Express server with RESTful APIs is set up to simulate obtaining GET or POST data formats from the backend for mock data integration, accelerating development.",
        "w9Title":"Institute for Information Industry - Project Cli",
        "w9Desc":"Mainly for internal use, including frontend framework design, planning, and package utilization. Currently includes React, Vue, Next, Nuxt, with automated initial project CLI （command line interface prompt）.",
        "w10Title":"Institute for Information Industry - Philippines Visa Web",
        "w10Desc":"Mainly adjusting the UI, UX, and RWD layout design of existing Aspx.net webpages, and setting up testing sites and deployment Use IIS.",
        "w11Title":"Aiontech - Internal Project",
        "w11Desc":"Maintaining existing company system web and developing new webpages, as well as developing new programs and maintaining existing programs in WinForms.",
        "w12Title":"Everproinsurance Brokers - Internal Project",
        "w12Desc":"Rewrite the company's asp web to aspx, and use the company's ERP development module. The frontend is mainly html and js. page is based on MVC architecture. The backend is mainly C#, and the serial database part is mainly SQL SERVER.",
        "w13Title":"Case - Kouyi Electronic Aluminum Sheet",
        "w13Desc":"Using React, responsible for creating frontend UI screens and integrating business logic with backend APIs. Establishing a server and RESTful API using Express to simulate retrieving GET or POST data formats from the backend for mock data integration to expedite development.",
        "w14Title":"Case - KuoKuang Material system",
        "w14Desc":"Use Vue3, it is responsible for making the frontend UI screen and business logic to connect to the backend API. The backend part is made by Express to exchange SQL with the database. The backend uses express to create server and resetfulApi, and interacts with the MySQL database Use Get or Post data format and SQL syntax. The program deployment part uses bash and docker to write automated program deployment. Just execute bash to complete the entire application deployment. Use Electron to write Excel files and upload Excel application tools and use WebSocket to communicate with the backend in real time. The server part uses Nginx to reverse proxy the API Path to avoid Cors Domain problems. In addition, the concept of Docker Network is used to connect the front and back ends. Hang in the same domain to avoid backend exposure",
        "w15Title":"Institute for Information Industry - Fwusow APP",
        "w15Desc":"Mainly adjusting maintain this project, frontend created by Android App, and backend created by Python Flask, main adjustment App new functions、optimization application's screen and business logic with database adjustment. and optimization old source code structure who writed and linux deploy actions.",
        "w16Title":"Institute for Information Industry - Sports Passbook App",
        "w16Desc":"It's a new develop PWA application, mainly collaborating with the backend to connect API and WebSocket's resource to display at  frontend views, presenting real-time IoT device values and triggering local applications.\n\nI'm primarily responsible for developing and designing the frontend UI and UX, integrating business logic with the backend APIs using React.",
        "w17Title":"Institute for Information Industry - Sports Passbook Terminal trigger Program",
        "w17Desc":"Mainly send event sources through the mobile web page to control the local program and use puppeteer to automatically control the process of displaying the riding views of the exercise bike game through crawling.",
        "w18Title":"Hua Nan Bank - Video Chorus System",
        "w18Desc":"Mainly assist in designing customized UI and views interaction animations for new functions."
    },
    "experienceModal": {
        "title":["Work Role","Work Details","Use Skill"]
    },
    "navigation":"Navigation",
    "closeText":"Close",
    "detailsText":"Details Description",
    "previewWeb":"Preview Web",
    "abountCollect":"Abount Collet",
    "onlyWebScreenShot":"Only Web ScreenShot",
    "previewSourceCode":"Preview Source Code"
}